---
kind: property
id: P:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.AngularDimensionsOffset
source: html/76094859-caa7-30ea-0e1c-cdd4725e2d7e.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.AngularDimensionsOffset Property

Identifies the offset of the angular dimensions.

## Syntax (C#)
```csharp
public double AngularDimensionsOffset { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for angularDimensionsOffset must be between 0 and 30000 feet.